{
    "experience": [
        {
            "jobTitle": "Software Engineer",
            "companyName": "TechnoPro",
            "date": "Japan (10/2017 - Present)",
            "jobDescription": "Currently involve as lead programmer (Full Stack) on client site in creating prototype web app that will act as Middleware App for Oracle Cloud Services using Node.js as Back-End and Oracle-Jet Template that is a combination of ReactJs, Knockout, and JQuery as front-end. Previously work in another client as web developer in an agile team where every member rotates every sprint as lead facilitator equivalent to Scrum Master. The duty of the facilitator is to make sure the task for the current sprint is reported to the client who is the product owner or the manager and avoid any problems that will delay the task. Everyone should have expertise, from system analysis to deployment and everyone should be involve in case problems occur as a team."
        },
        {
            "jobTitle": "Software Consultant / Contract Project",
            "companyName": "Moreton Bay Technology",
            "date": "Philippines (01/2017 - 09/2017)",
            "jobDescription": "The main role of a consultant is to ensure that enhancement and change request from the client is properly deliver, whether it is a program enhancement or creation of new modules in an existing system (Supply Chain Management System) which is deployed on client site and is unique for every Hotel Clients of the company. Generally, my role is support programmer but there was a time when they need me to go to Japan to provide end-user training and provide client site support so that if there is a simple enhancement request, like changing something on the report generated by the system, we can provide it as soon as possible on site. The system that we deployed is created on C# as back end and JQuery, and Kendo JavaScript framework."
        },
        {
            "jobTitle": "Software Engineer",
            "companyName": "Valtes Advance Technology.",
            "date": "Philippines (04/2016 - 01/2017)",
            "jobDescription": "Compile and write documentation of program development and subsequent revisions, inserting comments on the coded instructions so others can understand the program. Correct errors by making appropriate changes and rechecking the programs to ensure that the desired results is produced. Train subordinates in programming specially clean code approach, Japanese company cultures and a little Nihongo. Conduct trial runs of programs and software applications to make sure they will produce the desired information and that instructions are correct. Develop software web and desktop application that meets client requirements and expectations."
        }
    ]
}